# Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# Пример:
#
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]



lst = [1, 2, 3, 5, 1, 5, 3, 10]

result = [i for i in lst if lst.count(i) == 1]
print(result)